yuplus/nxp-mcx-series/MCXA344/periph3/PERI_INPUTMUX.h
/* The count of INPUTMUX_CTIMERC_CTIMER2CAP */
#define INPUTMUX_CTIMERC_CTIMER2CAP_COUNT        (4U)

/*! @name TIMER2TRIG - Trigger register for TIMER2 inputs */
/*! @{ */

#define INPUTMUX_TIMER2TRIG_INP_MASK             (0x7FU)
#define INPUTMUX_TIMER2TRIG_INP_SHIFT            (0U)
/*! INP - Input number for CTIMER2
 *  0b0000000..Reserved
 *  0b0000001..CT_INP0 input is selected
 *  0b0000010..CT_INP1 input is selected
 *  0b0000011..CT_INP2 input is selected
 *  0b0000100..CT_INP3 input is selected
 *  0b0000101..CT_INP4 input is selected
 *  0b0000110..CT_INP5 input is selected
 *  0b0000111..CT_INP6 input is selected
 *  0b0001000..CT_INP7 input is selected
 *  0b0001001..CT_INP8 input is selected
 *  0b0001010..CT_INP9 input is selected
 *  0b0001011..CT_INP10 input is selected
 *  0b0001100..Reserved
 *  0b0001101..CT_INP12 input is selected
 *  0b0001110..CT_INP13 input is selected
 *  0b0001111..CT_INP14 input is selected
 *  0b0010000..CT_INP15 input is selected
 *  0b0010001..CT_INP16 input is selected
 *  0b0010010..CT_INP17 input is selected
 *  0b0010011..CT_INP18 input is selected
 *  0b0010100..CT_INP19 input is selected
 *  0b0010101..Reserved
 *  0b0010110..AOI0_OUT0 input is selected
 *  0b0010111..AOI0_OUT1 input is selected
 *  0b0011000..AOI0_OUT2 input is selected
 *  0b0011001..AOI0_OUT3 input is selected
 *  0b0011010..ADC0_tcomp[0]
 *  0b0011011..ADC0_tcomp[1]
 *  0b0011100..ADC0_tcomp[2]
 *  0b0011101..ADC0_tcomp[3] input is selected
 *  0b0011110..CMP0_OUT is selected
 *  0b0011111..CMP1_OUT is selected
 *  0b0100000..CMP2_OUT is selected
 *  0b0100001..CTimer0_MAT1 input is selected
 *  0b0100010..CTimer0_MAT2 input is selected
 *  0b0100011..CTimer0_MAT3 input is selected
 *  0b0100100..CTimer1_MAT1 input is selected
 *  0b0100101..CTimer1_MAT2 input is selected
 *  0b0100110..CTimer1_MAT3 input is selected
 *  0b0100111..QDC0_CMP_FLAG0 is selected
 *  0b0101000..QDC0_CMP_FLAG1 input is selected
 *  0b0101001..QDC0_CMP_FLAG2 input is selected
 *  0b0101010..QDC0_CMP_FLAG3 input is selected
 *  0b0101011..QDC0_POS_MATCH0 input is selected
 *  0b0101100..PWM0_SM0_MUX_TRIG0 input is selected
 *  0b0101101..PWM0_SM1_MUX_TRIG0 input is selected
 *  0b0101110..PWM0_SM2_MUX_TRIG0 input is selected
 *  0b0101111..PWM0_SM3_MUX_TRIG0 input is selected
 *  0b0110000..LPI2C0 Master End of Packet input is selected
 *  0b0110001..LPI2C0 Slave End of Packet input is selected
 *  0b0110010..LPI2C1 Master End of Packet input is selected
 *  0b0110011..LPI2C1 Slave End of Packet input is selected
 *  0b0110100..LPSPI0 End of Frame input is selected
 *  0b0110101..LPSPI0 Received Data Word input is selected
 *  0b0110110..LPSPI1 End of Frame input is selected
 *  0b0110111..LPSPI1 Received Data Word input is selected
 *  0b0111000..LPUART0 Received Data Word input is selected
 *  0b0111001..LPUART0 Transmitted Data Word input is selected
 *  0b0111010..LPUART0 Receive Line Idle input is selected
 *  0b0111011..LPUART1 Received Data Word input is selected
 *  0b0111100..LPUART1 Transmitted Data Word input is selected
 *  0b0111101..LPUART1 Receive Line Idle input is selected
 *  0b0111110..LPUART2 Received Data Word input is selected
 *  0b0111111..LPUART2 Transmitted Data Word input is selected
 *  0b1000000..LPUART2 Receive Line Idle input is selected
 *  0b1000001..LPUART3 Received Data Word input is selected
 *  0b1000010..LPUART3 Transmitted Data Word input is selected
 *  0b1000011..LPUART3 Receive Line Idle input is selected
 *  0b1000100..Reserved
 *  0b1000101..Reserved
 *  0b1000110..Reserved
 *  0b1000111..AOI1_OUT0 input is selected
 *  0b1001000..AOI1_OUT1 input is selected
 *  0b1001001..AOI1_OUT2 input is selected
 *  0b1001010..AOI1_OUT3 input is selected
 *  0b1001011..ADC1_tcomp[0] input is selected
 *  0b1001100..ADC1_tcomp[1] input is selected
 *  0b1001101..ADC1_tcomp[2] input is selected
 *  0b1001110..ADC1_tcomp[3] input is selected
 *  0b1001111..Reserved
 *  0b1010000..Reserved
 *  0b1010001..Reserved
 *  0b1010010..Reserved
 *  0b1010011..Reserved
 *  0b1010100..Reserved
 *  0b1010101..QDC1_CMP_FLAG0 input is selected
 *  0b1010110..QDC1_CMP_FLAG1 input is selected
 *  0b1010111..QDC1_CMP_FLAG2 input is selected
 *  0b1011000..QDC1_CMP_FLAG3 input is selected
 *  0b1011001..QDC1_POS_MATCH0 input is selected
 *  0b1011010..PWM1_SM0_MUX_TRIG0 input is selected
 *  0b1011011..PWM1_SM1_MUX_TRIG0 input is selected
 *  0b1011100..PWM1_SM2_MUX_TRIG0 input is selected
 *  0b1011101..PWM1_SM2_MUX_TRIG0 input is selected
 *  0b1011110..Reserved
 *  0b1011111..Reserved
 *  0b1100000..Reserved
 *  0b1100001..Reserved
 *  0b1100010..Reserved
 *  0b1100011..Reserved
 *  0b1100100..Reserved
 *  0b1100101..Reserved
 *  0b1100110..Reserved
 *  0b1100111..Reserved
 *  0b1101000..Reserved
 *  0b1101001..Reserved
 *  0b1101010..Reserved
 *  0b1101011..Reserved
 *  0b1101100..Reserved
 *  0b1101101..Reserved
 *  0b1101110..Reserved
 *  0b1101111..Reserved
 *  0b1110000..Reserved
 */
#define INPUTMUX_TIMER2TRIG_INP(x)               (((uint32_t)(((uint32_t)(x)) << INPUTMUX_TIMER2TRIG_INP_SHIFT)) & INPUTMUX_TIMER2TRIG_INP_MASK)
/*! @} */

/*! @name SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG - SmartDMA Trigger Input Connections */
/*! @{ */

#define INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_INP_MASK (0x7FU)
#define INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_INP_SHIFT (0U)
/*! INP - Input number for FlexIO0.
 *  0b0000000..Reserved
 *  0b0000001..GPIO P0_16 input is selected
 *  0b0000010..GPIO P0_17 input is selected
 *  0b0000011..GPIO P1_8 input is selected
 *  0b0000100..GPIO P1_9 input is selected
 *  0b0000101..GPIO P1_10 input is selected
 *  0b0000110..GPIO P1_11 input is selected
 *  0b0000111..GPIO P1_12 input is selected
 *  0b0001000..GPIO P1_13 input is selected
 *  0b0001001..GPIO P2_0 input is selected
 *  0b0001010..GPIO P2_1 input is selected
 *  0b0001011..GPIO P2_2 input is selected
 *  0b0001100..GPIO P2_3 input is selected
 *  0b0001101..GPIO P2_6 input is selected
 *  0b0001110..GPIO P3_8 input is selected
 *  0b0001111..GPIO P3_9 input is selected
 *  0b0010000..GPIO P3_10 input is selected
 *  0b0010001..GPIO P3_11 input is selected
 *  0b0010010..GPIO P3_12 input is seclected
 *  0b0010011..GPIO0 Pin Event Trig input is selected
 *  0b0010100..GPIO1 Pin Event Trig input is selected
 *  0b0010101..GPIO2 Pin Event Trig input is selected
 *  0b0010110..GPIO3 Pin Event Trig input is selected
 *  0b0010111..GPIO4 Pin Event Trig input is selected
 *  0b0011000..ARM_TXEV input is selected
 *  0b0011001..AOI0_OUT0 input is selected
 *  0b0011010..AOI1_OUT1 input is selected
 *  0b0011011..DMA_IRQ input is selected
 *  0b0011100..MAU_IRQ input is selected
 *  0b0011101..WUU_IRQ input is selected
 *  0b0011110..CTimer0_MAT2 input is selected
 *  0b0011111..CTimer0_MAT3 input is selected
 *  0b0100000..CTimer1_MAT2 input is selected
 *  0b0100001..CTimer1_MAT3 input is selected
 *  0b0100010..CTimer2_MAT2 input is selected
 *  0b0100011..CTimer2_MAT3 input is selected
 *  0b0100100..Reserved
 *  0b0100101..Reserved
 *  0b0100110..Reserved
 *  0b0100111..Reserved
 *  0b0101000..OSTIMER_IRQ input is selected
 *  0b0101001..PWM0_IRQ input is selected
 *  0b0101010..PWM1_IRQ input is selected
 *  0b0101011..QDC0_IRQ input is selected
 *  0b0101100..QDC1_IRQ input is selected
 *  0b0101101..RTC_Alarm_IRQ input is selected
 *  0b0101110..RTC_1Hz_IRQ input is selected
 *  0b0101111..uTICK_IRQ input is selected
 *  0b0110000..WDT_IRQ input is selected
 *  0b0110001..Wakeup_Timer_IRQ input is selected
 *  0b0110010..CAN0_IRQ input is selected
 *  0b0110011..Reserved
 *  0b0110100..Reserved
 *  0b0110101..Reserved
 *  0b0110110..Reserved
 *  0b0110111..Reserved
 *  0b0111000..Reserved
 *  0b0111001..Reserved
 *  0b0111010..LPI2C0_IRQ input is selected
 *  0b0111011..LPI2C1_IRQ input is selected
 *  0b0111100..LPSPI0_IRQ input is selected
 *  0b0111101..LPSPI1_IRQ input is selected
 *  0b0111110..LPUART0_IRQ input is selected
 *  0b0111111..LPUART1_IRQ input is selected
 *  0b1000000..LPUART2_IRQ input is selected
 *  0b1000001..LPUART3_IRQ input is selected
 *  0b1000010..USB0_SOF input is selected
 *  0b1000011..Reserved
 *  0b1000100..ADC0_IRQ input is selected
 *  0b1000101..ADC1_IRQ input is selected
 *  0b1000110..ADC2_IRQ input is selected
 *  0b1000111..ADC3_IRQ input is selected
 *  0b1001000..CMP0_IRQ input is selected
 *  0b1001001..CMP1_IRQ input is selected
 *  0b1001010..CMP2_IRQ input is selected
 *  0b1001011..CMP0_OUT input is selected
 *  0b1001100..CMP1_OUT input is selected
 *  0b1001101..CMP2_OUT input is selected
 *  0b1001110..DAC0_IRQ input is selected
 *  0b1001111..SLCD_IRQ input is selected
 */
#define INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_INP(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_INP_SHIFT)) & INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_INP_MASK)
/*! @} */

/* The count of INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG */
#define INPUTMUX_SMARTDMA_TRIGGER_INPUTN_SMARTDMA_TRIG_COUNT (8U)

